{
    "news": [
        {
            "header": "New IALR Launcher!",
            "body": "You no longer have to worry about getting the latest version of the mod from the NexusMods, when launching the launcher you'll see if there is a new version of the mod available. If the UPDATE IALR button is visible, click it and it will update the underlying code. If you have already installed the mod, your previous selection will be used when updating the code so you don't have to run the installer again! Use the installer to change your selected options."
        },
        {
            "header": "Halloween Event",
            "body": "Vampires can be found throughout the world at night and in some interiors. They are friends of no one but their clan and move deadly fast. Run if you are not high enough level to take them on, as they will call for other nearby Vampires when you are spotted. Evil Clowns have joined the world and can be found randomly through encounters. The event is still be fully updated and implemented, but thankfully the launcher should make this easy to get the updates!"
        },
        {
            "header": "Human AI overhaul",
            "body": "Many improvements to the AI's ability to detect and interact with the world and each other, fixes for aggression and blocking."
        },
        {
            "header": "Difficulty Balancing",
            "body": "Started fresh on re-balancing every difficulty, your feedback is appreciated"
        },
        {
            "header": "Removal of visual effects from Biters and Infected",
            "body": "Feedback is always appreciated on the mod, especially if it's something that is causing players frustration"
        },
        {
            "header": "Fix for crash",
            "body": "Found and removed a crash due to changing the inventory size"
        },
        {
            "header": "Fix for human melee weapon damage",
            "body": "Finally found the cause of the weapon damage being so low on human melee enemies, this has been fixed"
        },
        {
            "header": "Fix for spawn error on Casual Survivor",
            "body": "Fixed a bug with the spawn code and a syntax merge error on Casual"
        },
        {
            "header": "NG+ Crash fix",
            "body": "Fixed an issue with the spawn system that was causing a crash while playing New Game+"
        },
        {
            "header": "Fix for Peace Keeper armor",
            "body": "Updated and fixed the references for the Peacekeeper armor. This also applies to the Peace Keeper Pathway"
        },
        {
            "header": "Fix for spitters spawning during the day",
            "body": "Removed the standard spitters from spawning during the day, the bloater/puker spitters should still spawn depending on the mod difficulty"
        }
    ]
}