{
    "news": [
        {
            "header": "Updated to 1.13.3",
            "body": "Please report bugs on the Discord ialr-dl2-bug-reporting channel, thanks and happy gaming"
        },
        {
            "header": "New Chaos System",
            "body": "This system is designed to give you a chance at unique Epic moments while you play, enemies and allies will spawn inside the world randomly based on your Mod difficulty."
        },
        {
            "header": "Halloween Event",
            "body": "Vampires can be found throughout the world at night and in some interiors. They are friends of no one but their clan and move deadly fast. Run if you are not high enough level to take them on, as they will call for other nearby Vampires when you are spotted. Evil Clowns have joined the world and can be found randomly through encounters. The event is still be fully updated and implemented, but thankfully the launcher should make this easy to get the updates!"
        },
        {
            "header": "Human AI overhaul",
            "body": "Many improvements to the AI's ability to detect and interact with the world and each other, fixes for aggression and blocking."
        },
        {
            "header": "Difficulty Balancing",
            "body": "Started fresh on re-balancing every difficulty, your feedback is appreciated"
        },
        {
            "header": "Removal of visual effects from Biters and Infected",
            "body": "Feedback is always appreciated on the mod, especially if it's something that is causing players frustration"
        },
        {
            "header": "New Warzones Update",
            "body": "Utilizing the new chaos system, Warzones is back with a much needed upgrade. The cities will now spawn groups/squads of enemies that will band together to take down their foes."
        },
        {
            "header": "Fix for Instant heal consumables",
            "body": "A small fix to update the mod to work with the new instant heal items"
        },
        {
            "header": "Fix for Bows and Crossbows",
            "body": "Fix for a glitch causing players to not be able to draw their crossbows or bows"
        },
        {
            "header": "Fix for Volatile Hives spawning outdoors",
            "body": "This fix should prevent as many hives showing up outdoors"
        },
        {
            "header": "Reduction to Goons and Demolishers on Ultimate",
            "body": "Reduced the amount of chaos agents that spawn goons and demolishers on Ultimate Difficulty"
        },
        {
            "header": "Reduction to chaos on Survivor",
            "body": "Removed and reduced the amount of chaos agents working on Survivor Difficulty"
        }
    ]
}