{
    "news": [
        {
            "header": "Updated to 1.15.2",
            "body": "Please report bugs on the Discord ialr-dl2-bug-reporting channel, thanks and happy gaming"
        },
        {
            "header": "New Survivor Options: Hunger and Thirst Optional",
            "body": "Take the games difficulty and scavenging to a new level with a new optional in the Modules section that requires the player to eat and drink to properly regenerate health and stamina"
        },
        {
            "header": "New Winter Slaughter-Land Module",
            "body": "Turns the map into Winter with new weather conditions: clear, lite snowy, snowy, snow with rain, and blizzard. More coming soon!"
        },
        {
            "header": "Human AI Refactor/Companion improvements",
            "body": "A much needed update to the human AI. They should attack enemies with more aggression and they now use the buildings, cars, signs, and other parkour elements to traverse the city, making it easier for them to avoid running into piles of enemies and getting wiped out."
        },
        {
            "header": "New Companion improvements",
            "body": "The companions are now more aware of their surroundings and do a better job at protecting the player. They also now utilize the level tier system to improve their weapons, stamina, and health as you progress through the game. This system still needs a lot of love but it's a step in the right direction. Companions will also attempt to avoid using roads and will instead use Parkour to traverse the city, making it easier for them to avoid running into piles of enemies and getting wiped out. They will also use defensive measures to move through the city while trying to keep up with the player"
        },
        {
            "header": "New Infestation Module",
            "body": "The city no longer is safe during the day. The infected no longer suffer from the sunlight and will stop at nothing to kill you."
        },
        {
            "header": "New Deadly Humans Module",
            "body": "Tired of humans being the least scary thing on the map? Active this module and fear the living"
        },
        {
            "header": "New Remove Volatile Module",
            "body": "Tired of getting slaughtered by the Volatiles at night? Now you can roam free using the Casual Survivor spawn settings but without Volatiles"
        },
        {
            "header": "New Remove Weapon Mod Visuals Module",
            "body": "Want to get rid of those attachments on your weapons that ruin your sense of immersion? Toggle on this module to enjoy the game without the cluttered weapon appearances"
        },
        {
            "header": "New Languages Update",
            "body": "All of the supporting language packs have been recreated and the Czech language support has been added!"
        },
        {
            "header": "New Chaos System",
            "body": "This system is designed to give you a chance at unique Epic moments while you play, enemies and allies will spawn inside the world randomly based on your Mod difficulty."
        },
        {
            "header": "Noise Spawn System Restored",
            "body": "The Day hunter, Night Hunter, Volatile, Chase, and Screamer Noise systems have been restored with new balancing for all difficulties. Day Hunter is disabled on Casual and Survivor."
        },
        {
            "header": "Chase System Updated/Rebalanced",
            "body": "The chase system has gotten a much needed tuning. Still a WIP and feedback is appreciated across the different difficulties."
        },
        {
            "header": "Halloween Event",
            "body": "Vampires can be found throughout the world at night and in some interiors. They are friends of no one but their clan and move deadly fast. Run if you are not high enough level to take them on, as they will call for other nearby Vampires when you are spotted. Evil Clowns have joined the world and can be found randomly through encounters. The event is still be fully updated and implemented, but thankfully the launcher should make this easy to get the updates!"
        },
        {
            "header": "Human AI overhaul",
            "body": "Many improvements to the AI's ability to detect and interact with the world and each other, fixes for aggression and blocking."
        },
        {
            "header": "Difficulty Balancing",
            "body": "Started fresh on re-balancing every difficulty, your feedback is appreciated"
        },
        {
            "header": "Removal of visual effects from Biters and Infected",
            "body": "Feedback is always appreciated on the mod, especially if it's something that is causing players frustration"
        },
        {
            "header": "New Warzones Update",
            "body": "Utilizing the new chaos system, Warzones is back with a much needed upgrade. The cities will now spawn groups/squads of enemies that will band together to take down their foes."
        },
        {
            "header": "Fix for Instant heal consumables",
            "body": "A small fix to update the mod to work with the new instant heal items"
        },
        {
            "header": "Fix for Bows and Crossbows",
            "body": "Fix for a glitch causing players to not be able to draw their crossbows or bows"
        },
        {
            "header": "Fix for IALR Traders",
            "body": "This fix should allow the custom traders to properly show items"
        },
        {
            "header": "Fix for Enemies Nearby Bug",
            "body": "This was occuring on some quests. This should be better balanced, but also try sleeping till daytime or use camouflage to help lose the scent of enemies"
        },
        {
            "header": "Fix for only Biter Camouflage spawning",
            "body": "Better balancing for all types of camouflage to spawn on special infected"
        },
        {
            "header": "Reduction to chaos on Survivor",
            "body": "Removed and reduced the amount of chaos agents working on Survivor Difficulty"
        }
    ]
}