{
    "difficulties": [
        {
            "name": "IALR Content",
            "description": "Vanilla + IALR Content: Play the vanilla game with a savegame that has the IALR items already added, this is not for playing the actual mod, only to support players who want to try to play Vanilla events with less chance of corrupting their savegames. You should still backup your savegame",
            "image": "button_difficulties_content.jpg",
            "folder": "difficulty_0_IALRContent"
        },
        {
            "name": "Casual Survivor",
            "description": "Casual Survivor: This version of the mod reduces the threat of the Volatiles from the vanilla game while increasing the intelligence of the humans, biters, and other infected. Great for players who want to learn the ropes and enjoy Parkour and the new items from the Mod without worrying too much.",
            "image": "button_difficulties_casual.jpg",
            "folder": "difficulty_1_CasualSurvivor"
        },
        {
            "name": "Survivor",
            "description": "Survivor: This version of the mod is meant for all the Lore based players who want a challenging and interesting game without the intensity. Zombies will be more dense on the map than Casual Survivor and will also be able to hear the players actions better. Banshees, chargers, and goons have been added back to the world so you'll have more to deal with on top of a redesigned HumanAI, now designed to clear the streets and take back the city from the other factions. This should be everyone's recommended difficulty to start with, if you want and easier experience then change to Casual and if you are familiar with the game and want to be always under threat when outside a base, look to Ultimate.",
            "image": "button_difficulties_survivor.jpg",
            "folder": "difficulty_2_Survivor"
        },
        {
            "name": "Ultimate Survivor",
            "description": "Ultimate Survivor: This version is meant to give players something new once they have played the game and know the basic functions and actions. Running can trigger enemies spawning and hunting for you, including the Daystalker Volatile. There are a mix of biters in the world with a higher density of enemies and hordes. There are more fresh dead (running and climbing zombies) than in Survivor but with better balancing for the experienced player looking to play Ultimate Survivor through the main quest. The spawns are much higher, the volatiles more deadly, and HumanAI will be relentless. You will need to use tools such as decoys, deployable UV lights, explosives, and camoflauge to survive this difficulty. You can set your Walk Toggle in the games settings to avoid awakening the Infected and Daytime hunters.",
            "image": "button_difficulties_ultimate.jpg",
            "folder": "difficulty_3_UltimateSurvivor"
        },
        {
            "name": "Insanity",
            "description": "Insanity: This version of the mod is meant for the players that want a serious challenge when leaving the safezones in the day and night. This difficulty is a great way to revisit the game if you're looking for to see all the new enemies added by the mod while also getting more loot and rewards for your efforts. You can set your Walk Toggle in the games settings to avoid awakening the Infected and Daytime hunters. You will need to use tools such as decoys, deployable UV lights, explosives, and camoflauge to survive this difficulty. IALR Veterans recommended.",
            "image": "button_difficulties_insanity.jpg",
            "folder": "difficulty_4_Insanity"
        }
    ]
}